[
    {
        "Job ID": "3499519671",
        "Job Title": "Junior Data Engineer",
        "Company Name": "Open Road Media",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-01-31",
        "Seniority level": "Entry level",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Photography",
        "job_description": "About Open Road Integrated MediaOpen Road Integrated Media is a prestige content brand delivering digital experiences that entertain and inform readers around the world. Open Road was founded in 2009 with the belief that great marketing and great content are the engines of growth for underserved authors and books. This philosophy is at the core of everything that we do. Open Road revolutionizes how publishers service authors, agents, and readers.SummaryThe Data Engineering and Analytics team is seeking a Junior Data Engineer. This role will work on various types of tasks and projects. The members of Data Engineering and Analytics team uses rigorous analytics to generate insights that inform product, marketing, and business decisions across the company. In the meantime, we build systems, infrastructure, data products for collecting, storing, and visualizing data to foster the data democracy in the company. We work in Python, SQL and we work with technologies like Airflow, Django, Tableau, Spark.Essential FunctionsETLDesign and build ETL pipelines by using Airflow to collect data from different sources to data warehousesBuild pipeline integration with our various data products for long-running processesIdentify the room for optimizing relational data storage through design, query optimization, indices, replicas, partitioning, etc.AutomationBuild ad-hoc scripts or recurring processes to fully/partially automate labor-intensive workflows of other departments (e.g. Production, Marketing)Requirements1-2 years hands-on experience in ETL design, implementation and maintenanceExperience in schema design and data modelingExperience in writing complex SQL queries to extract data from relational databases (e.g. MySQL, Redshift)Experience in version control systems such as GitExperience in the following tools/technology is a plusAirflow, Django, Git, DockerComfortable with extensive Python codingWilling to work with a codebase that is not originally written by youGood communication skills; understand that being an effective engineer is about communicating with people as much as it is about writing codeWilling to learn any language/tools/frameworks that are necessary to get the job done CompensationSalary will be commensurate with qualifications and experience. The salary range for this position is $55,000.00 - $75,000.00."
    },
    {
        "Job ID": "3512575736",
        "Job Title": "Data Engineer, Analytics (Generalist)",
        "Company Name": "Instagram",
        "Location": "New York, NY",
        "Salary": "$243,000.00-$312,000.00",
        "Publish Date": "2023-03-03",
        "Seniority level": "Not Applicable",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Technology, Information and Internet",
        "job_description": "Every month, billions of people leverage Meta products to connect with friends and loved ones from across the world. On the Data Engineering Team, our mission is to support these products both internally and externally by delivering the best data foundation that drives impact through informed decision making. As a highly collaborative organization, our data engineers work cross-functionally with software engineering, data science, and product management to optimize growth, strategy, and experience for our 3 billion plus users, as well as our internal employee community. We are looking for a technical leader in our Data Engineering team to work closely with Product Managers, Data Scientists and Software Engineers to support building out a great platform for the future of computing. In this role, you will see a direct correlation between your work, company growth, and user satisfaction. You’ll work with some of the brightest minds in the industry, work with one of the richest data sets in the world, use cutting edge technology, and see your efforts affect products and people on a regular basis.The ideal candidate will have strong data infrastructure and data architecture skills as well as experience in areas such as governing company wide data marts, enabling security and privacy data solutions, and full stack experience with analytical technologies. Candidates should also have a proven track record of leading and scaling efforts related to end-to-end analytics systems, strong operational skills to drive efficiency and speed, strong project management leadership, and a strong vision for how data can proactively improve companies.As we continue to expand and create, we have a lot of exciting work ahead of us!Data Engineer, Analytics (Generalist) Responsibilities:Proactively drive the vision for data foundation and analytics to accelerate building and improvement of cross platform components across Instagram, and define and execute on plan to achieve that vision.Conceptualize and own the data architecture for multiple large-scale projects, while evaluating design and operational cost-benefit tradeoffs within systems.Create and contribute to frameworks that improve the efficacy of logging data, while working with data infrastructure to triage issues and resolve.Build cross-functional relationships with Data Scientists, Product Managers and Software Engineers to understand data needs and deliver on those needs.Define and manage SLA for all data sets in allocated areas of ownership.Determine and implement the security model based on privacy requirements, confirm safeguards are followed, address data quality issues, and evolve governance processes within allocated areas of ownership.Design, build, and launch collections of sophisticated data models and visualizations that support use cases across different products or domains.Solve our most challenging data integrations problems, utilizing optimal ETL patterns, frameworks, query techniques, sourcing from structured and unstructured data sources.Assist in owning existing processes running in production, optimizing complex code through advanced algorithmic concepts.Optimize pipelines, dashboards, frameworks, and systems to facilitate easier development of data artifacts.Influence product and cross-functional teams to identify data opportunities to drive impact.Mentor team members by giving/receiving actionable feedback.Minimum Qualifications:Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.12+ years experience in the data warehouse space.12+ years experience in custom ETL design, implementation and maintenance.12+ years experience with object-oriented programming languages.12+ years experience with schema design and dimensional data modeling.12+ years experience in writing SQL statements.Experience analyzing data to identify deliverables, gaps and inconsistencies.Experience managing and communicating data warehouse plans to internal clients.Preferred Qualifications:BS/BA in Technical Field, Computer Science or Mathematics.Experience working with either a MapReduce or an MPP system.Knowledge and practical application of Python.Experience working autonomously in global teams.Experience influencing product decisions with data.Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. We may use your information to maintain the safety and security of Meta, its employees, and others as required or permitted by law. You may view Meta's Pay Transparency Policy, Equal Employment Opportunity is the Law notice, and Notice to Applicants for Employment and Employees by clicking on their corresponding links. Additionally, Meta participates in the E-Verify program in certain locations, as required by law"
    },
    {
        "Job ID": "3523177988",
        "Job Title": "Data Engineer",
        "Company Name": "Wider Circle",
        "Location": "New York, United States",
        "Salary": null,
        "Publish Date": "2023-02-14",
        "Seniority level": "Not Applicable",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Technology, Information and Internet",
        "job_description": "Overview:Data Engineers serve a unique and important role in daily operations at Wider Circle. Customer data is the bedrock of our business, and Data Engineering is responsible for laying the foundation for our success. Data Engineers work with internal and external stakeholders to gather, validate, clean and move data inside and outside the organization using technology and automation. Our data engineering team is also responsible for quality curation of data to ensure our productsYou will be joining a talented, fully remote Data Science, Engineering and Analytics team that handles a wide range of requests including customer data processing, weekly report automation, new product development and complex data integration.Company OverviewAt Wider Circle, we connect neighbors for better health. Wider Circle's groundbreaking Connect for Life® program brings neighbors together in-person and online for health, wellness, and social activities that improve mental and physical health. We create webs of community circles by employing local and culturally competent engagement specialists, whose hand-on-hand approach to forming trusted circles is informed by a sophisticated analytics platform. We are on a mission to make the world a better place for older adults and disadvantaged communities.ResponsibilitiesConceptualize data architecture (visually) and implement practically into logical structures.Manage internal SLAs for data quality and frequency.As a partner to data science and analytics provide modeled data for analysis and investigation.Setting up data ingestion schemes of raw data into S3 and Redshift.Executing automation to deploy data pipelines.Provide expert support for solving complex problems of data integration across multiple data sets.Performing testing of data after ingesting and database loading.Updating and evolving our data ecosystem to streamline processes for maximum efficiency.RequirementsTechnical RequirementsExperience with AWS or similar (S3, Redshift, RDS, EMR) 3+ YearsStrong abilities with SQL & Python 3+ YearsExperience using API's for data extraction and updatingExperience with Git and version controlPreferred:Experience with Healthcare Data (Claims, CDAs/HRAs, Eligibility)Experience using Salesforce (Salesforce API)Matillion, Mulesoft or related toolingAirflow, cron or other automation toolsExperience working with Data Packages written in R or PythonExperience partnering with Data Scientists to optimize or productionalize modelsBenefitsAs a venture-backed company, Wider Circle offers competitive compensation, including:Performance-based incentive bonusesOpportunity to grow with the companyComprehensive health coverage, including medical, dental, and vision401(k) PlanPaid Time OffEmployee Assistance ProgramHealth Care FSADependent Care FSAHealth Savings AccountVoluntary Disability BenefitsBasic Life and AD&D InsuranceAdoption Assistance ProgramTraining and DevelopmentSalary $120,000-$140,000And most importantly, an opportunity to make the world a better place!Wider Circle is proud to be an equal-opportunity employer that does not tolerate discrimination or harassment of any kind. Our commitment to Diversity & Inclusion supports our ability to build diverse teams and develop inclusive work environments. We believe in empowering people and valuing their differences. We are committed to equal employment opportunity without consideration of race, color, religion, ethnicity, citizenship, political activity or affiliation, marital status, age, national origin, ancestry, disability, veteran status, sexual orientation, gender identity, gender expression, sex or gender, or any other basis protected by law"
    },
    {
        "Job ID": "3506555861",
        "Job Title": "Data Engineer",
        "Company Name": "BLACKBIRD.AI",
        "Location": "New York, United States",
        "Salary": null,
        "Publish Date": "2023-02-04",
        "Seniority level": "Not Applicable",
        "Employment type": "Full-time",
        "Job function": "Engineering",
        "Industries": "Technology, Information and Internet",
        "job_description": "This is a fully remote opportunity at Blackbird.AI. You will not be required to relocate.The Company:What has been the effect of disinformation on the world?Blackbird.AI creates leading-edge AI software to provide critical real-time insights to provide our clients with a deep understanding of ongoing disruptive narratives, their motives, and overall digital noise. We are united by our dedication to our mission. We believe that we have a responsibility to society and that our service is vitally needed by organizations and individuals to create an empowered and critical thinking society.If this mission resonates with you, we'd love to hear from you.The Opportunity:Get ready to join a small but growing team of highly talented engineers and leaders, building exciting AI-driven services and technologies. As a Data Engineer for Blackbird.AI, you will own the pipeline optimization for a real-time streaming cloud-hosted analytics platform that spans data collection and analysis, and serves results to a user dashboard for interactive visual exploration. Our position requires a breadth of experience with database technologies, especially the engineering of horizontally scalable solutions for big data.Responsibilities:Writes ETL processes to support ingestion and normalization of a wide variety of social media, news, and web scrape formatsDesigns database systems and develops tools for query and analytic processing, including for streaming real-time applicationsPerforms analysis and comparative empirical studies to evaluate performance tradeoffs with respect to scaling (e.g., cost vs throughput/latency)Develops, manages and owns the database architecture for a real-time streaming cloud hosted analytics platform, spanning data collection, analytics and user managementOwns build automation, continuous integration, deployment and performance optimization in compliance with our security requirementsRequirementsMust Have:BS degree in Computer Science or equivalentDemonstrated product success with deployment in the cloud and SaaS model; proven capability to develop processing pipeline for platforms that are optimized for streaming analytics applications and that are cloud agnostic (Kubernetes, dockerized solutions)Expert level capable on PostgreSQL, Neo4j (graph), ElasticSearch, MongoDB, Redis, Druid, with other NoSQL and graph DBs helpfulExperienced with horizontal scaling of databasesExperienced with Kafka and Airflow; expert in applying tools for runtime profiling to optimize throughput and latency and establish comparative performance benchmarksCapable in build automation, continuous integration and deployment (CI/CD) tools, e.g. Webpack, Buddy or using Jenkins + dockerExpert level Python code developmentExperience working with distributed teamsHelpful to Have:Technical background in Artificial Intelligence (AI) and Machine Learning (ML) Experience designing and implementing interactive query-driven man-machine intelligence systemsSolid skills in JavaBenefitsHealth Care Plan (Medical, Dental & Vision)Paid Time Off (Vacation, Sick & Public Holidays)Work From HomeStock Option PlanExciting career development prospects, to grow into leadership rolesTake note - due to the high volume of applicants, only shortlisted candidates will be notified. Thank you for taking the time to apply for the role at Blackbird.AI.LI-Remote"
    },
    {
        "Job ID": "3532063438",
        "Job Title": "Data Engineer",
        "Company Name": "theSkimm",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-03-20",
        "Seniority level": "Entry level",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Technology, Information and Internet",
        "job_description": "theSkimm'We're hiring a Data Engineer.About Our Team And What We'll Build TogetherWe're looking for an experienced data engineer and mentor to join theSkimm's Tech team. Our mission is to enable our partners across theSkimm, from Editorial and Audio to Marketing and Advertising, to achieve their goals with the best systems and processes we can offer. We build tools throughout the stack, share knowledge across departments, and learn quickly so we can take best advantage of what's coming.As we grow, we're looking for a Senior Data Engineer who will help solidify and expand our pipelines and maintain our data warehouse. Our business is run on detailed analysis of how our products perform with our members, which features they love and which can be improved, and which product and marketing campaigns are bringing in the best quality users. You'll be responsible for working alongside analysts, product, marketing, and other teams to define new data collection components and measurement schemes that support each new product and feature.How You'll Contribute To Our MissionCreate and maintain data pipelines to provide insights and drive business decisionsEstablish theSkimm's data warehousing strategy (ex. Kimball, Data Vault, etc.)Maintain theSkimm's data infrastructure on our AWS accountsCollaborates with analytics and business teams to improve data models that feed business intelligence tools, increasing data accessibility and fostering data-driven decision making across the organization. Write unit/integration tests, contributes to engineering wiki, and documents workImplement processes and systems to monitor data quality, ensuring production data is always accurate and available for key stakeholders and business processes that depend on itYou're ready for this! Here's a bit more about what we're looking for3+ years of industry experience measuring product performance and user behaviorExperience working with a variety of data management technologies, including RedShift, Kinesis/Kafka, Glue, Spark, Postgres, Airflow, dbt, and others. Experience implementing BI reporting tools such as LookerExperience interfacing with engineers, product managers and analysts to understand data needsKnowledge of a variety of measurement beacons, SDKs, APIs including Google Analytics, Amplitude, Braze, Stripe, email service providersA commitment to building secure, resilient, fault-tolerant architectures, with clear documentation and procedures in place for supportA focus on accuracy and detail as you build, ensuring data pipelines produce clear, predictable resultsAbility to thrive in a dynamic, fast-paced, collaborative, and high-growth environmentFacility in presenting and discussing the trade-offs in employing different engineering solutions to a problem, valuing pragmatism over idealismAn empathetic leadership style that encourages open communication and trustUnderstanding of the typical metrics a subscription and advertising-supported business needs to measure successExperience with ML techniques as applied to behavioral segmentation or anomaly identification is a plusFamiliarity using developer tools that increase productivity and facilitate the development of resilient code (eg. Docker, CircleCI, Serverless) is a plusFamiliarity and enthusiasm for theSkimm: a passion for our audience and mission is a plusThe expected annual base salary for this role is $125,000-$135,000. We'll consider a variety of factors when determining the offered base salary including an evaluation of a candidate's skills, abilities, experience, location, market demands, and internal parity.Why our employees love working hereWe are mission driven and values driven:We are collectively building an impactful brand to empower generations of informed, confident women. Our vision is for every woman to have the info they need to navigate a complex world and the decisions in it. Every role has a purpose and allows us to provide useful information succinctly and contextualized. We tee her up to take action - whichever action is right for her, wherever she is.We are values driven at every point - how we work, the way we work and our culture come straight from our core values. Each of us supports this incredible brand and takes part in its continued growth, fulfilling the needs of our audience each and every day.We put you and your personal lives first - we have a generous benefits policy that demonstrates we are listening to what our employees need:Unlimited vacation policy and generous holiday observancesEncouraged time off on your birthday and Skimm'versary A hybrid working model with flexibility for remote workComprehensive insurance plans and commuter benefitsAuto-enrollment into an Empower 401(k) plan starting on your first day and employer contribution available after one year of employment Rewards for every work anniversaryOne month paid sabbatical after your five year Skimm'versary as a full-time employeeWe support our parents at all points on their journey: 18 weeks of paid parental leave (adoption, fostering and surrogacy included)Bereavement leave for pregnancy lossPhased return to work schedule availabilityFlexibility based on parental schedulesAccess to family building and fertility benefitsFlexible and broad-scale child support programYour well being is our priority: We honor Sacred Time in our workplaceWe have aligned company \"time off\" during the summer to truly allow for us all to break from our work at the same timeWe offer fitness membership reimbursementOne Medical Membership is included with our benefitsWe have a vibrant, collaborative, and supportive culture (we celebrate and have fun!):Weekly company updates led by our executive teamEmployee Resource GroupsAnnual employee award ceremony to celebrate individual accomplishmentsClubs and activities designed to meet other employees like book clubs, new hire buddy programs, off-sites, and wellness focused classesNumerous culture events that enable our workforce, in the office and remote, to connect and have funYour career and development are a priority: Annual learning and development stipendLEAD@theSkimm, our leadership development programDEI initiatives to ensure we are the best partners and colleagues to each otherCareer development guidance and planningAnd more…Competitive salary and equity packagesThe opportunity to be part of a values-driven, hardworking, and diverse group of people building a media company that makes it easier to live smarterOur story, Skimm'dWe are a digital media company, dedicated to succinctly giving women the information they need to make confident decisions. We make it easier to live smarter.At our core, we are writers, editors, producers, designers, marketers, engineers, analysts, sellers, creatives, and strategists all working together to achieve this goal.Every day we're breaking down the news, trends, policies, and politics that impact women so that they can navigate their daily lives and futures – from managing their paychecks to casting their ballots – with confidence. We provide our dedicated audience of millions with reliable, non-partisan, information, informing and empowering them while fitting into their daily routines.Since disrupting the media landscape and defining a new category a decade ago, we have become a trusted source for our audience of millions by seamlessly integrating into their existing routines, fundamentally changing the way they consume news and make decisions. Today theSkimm ecosystem includes the Daily Skimm, the Daily Skimm: Weekend, Skimm Money and Skimm Your Life newsletters, \"9 to 5ish with theSkimm\" podcast, theSkimm mobile app, and Skimm Studios which creates innovative in-house video and audio content. Our first book, How to Skimm Your Life debuted at #1 on The New York Times Best Seller list. Through Skimm Impact, our purpose-driven platform, we are proud to support get-out-the-vote efforts with Skimm Your Ballot, which has spurred more than one million voting-related actions across the last three election cycles, and its #ShowUsYourLeave movement, creating transparency and change for Paid Family Leave in the U.S.Come join us!Learn More About Us And Our Other Opportunities Here.What about the office?This is a full-time role with flexibility for remote work.Our office is available to use three days a week - Tuesday, Wednesday, and Thursday. We have a hybrid environment and ask that employees within the New York Metro area come together in person a minimum of three days per month. All other days are up to the discretion of the employees during the three days a week that the office will be open.We are continuing to closely monitor the state of COVID-19 in New York and will adjust this plan accordingly.Any correspondence from our team will come from a @theskimm.com email account!Please click here for theSkimm's Privacy Policy and Terms & Conditions.Important Notice to Job Applicants residing in the State of CaliforniaNatural persons who reside in the State of California should review the Notice to California Residents (Job Applicants). You may have additional rights under California law.theSkimm'We're hiring a Brand Strategy Manager.About Our Team And What We'll Build TogetherThe Brand Strategy team at theSkimm is a group of experienced, creative and resourceful hustlers who are relentless in their pursuit to grow the number of amazing brands and clients we partner with. We're seeking an enthusiastic Brand Strategist who is eager to contribute to our growing media business by working cross-functionally on pre-sale strategy and RFP response.How You'll Contribute To Our MissionThe team plays an integral role in the ideation and development of sponsored marketing programs across theSkimm's product suite. As a Brand Strategy Manager, you will:Drive the development, ideation, and strategic thinking of best-in-class marketing solutions for theSkimm's strategic advertising partnersOwn the strategic platform for marketing programs and partner with internal teams, including Marketing, Editorial, Insights, Product, Social/Video, to ensure recommendations are smart and cohesiveProvide quick and thoughtful packaging of strategic recommendations into smart, concise marketing collateral and proposals Attend client and agency meetings to learn about new initiatives, brainstorm and present recommendationsIdentify new/proactive opportunities and positioning for brand partners/verticals leveraging proprietary data and research Assist in the creation of ad hoc sales marketing materials that could include packages, product one-sheets, case studies, and best practices You're ready for this! Here's a bit more about what we're looking for4+ years building cross-platform digital marketing programsStrategic, creative thinker with a proven track record of turning ideas into holistic content programs Excellent writing, proofreading and verbal communication skillsDesign-minded with the ability to create effective visual presentationsAbility to work well with different stakeholders across the organization Ability to manage and prioritize multiple deliverables Highly motivated self-starter that is extremely detail orientedProficiency in KeynoteKnowledge of theSkimm brand and our products Experience managing RFP pipeline and working with Sales, Insights, Creative, and Design teams You may be asked to submit past work samples.The expected annual base salary for this role is $105,000-$115,000. We'll consider a variety of factors when determining the offered base salary including an evaluation of a candidate's skills, abilities, experience, location, market demands, and internal parity.Why our employees love working hereWe are mission driven and values driven:We are collectively building an impactful brand to empower generations of informed, confident women. Our vision is for every woman to have the info they need to navigate a complex world and the decisions in it. Every role has a purpose and allows us to provide useful information succinctly and contextualized. We tee her up to take action - whichever action is right for her, wherever she is.We are values driven at every point - how we work, the way we work and our culture come straight from our core values. Each of us supports this incredible brand and takes part in its continued growth, fulfilling the needs of our audience each and every day.We put you and your personal lives first - we have a generous benefits policy that demonstrates we are listening to what our employees need:Unlimited vacation policy and generous holiday observancesEncouraged time off on your birthday and Skimm'versary A hybrid working model with flexibility for remote workComprehensive insurance plans and commuter benefitsAuto-enrollment into an Empower 401(k) plan starting on your first day and employer contribution available after one year of employment Rewards for every work anniversaryOne month paid sabbatical after your five year Skimm'versary as a full-time employeeWe support our parents at all points on their journey: 18 weeks of paid parental leave (adoption, fostering and surrogacy included)Bereavement leave for pregnancy lossPhased return to work schedule availabilityFlexibility based on parental schedulesAccess to family building and fertility benefitsFlexible and broad-scale child support programYour well being is our priority: We honor Sacred Time in our workplaceWe have aligned company \"time off\" during the summer to truly allow for us all to break from our work at the same timeWe offer fitness membership reimbursementOne Medical Membership is included with our benefitsWe have a vibrant, collaborative, and supportive culture (we celebrate and have fun!):Weekly company updates led by our executive teamEmployee Resource GroupsAnnual employee award ceremony to celebrate individual accomplishmentsClubs and activities designed to meet other employees like book clubs, new hire buddy programs, off-sites, and wellness focused classesNumerous culture events that enable our workforce, in the office and remote, to connect and have funYour career and development are a priority: Annual learning and development stipendLEAD@theSkimm, our leadership development programDEI initiatives to ensure we are the best partners and colleagues to each otherCareer development guidance and planningAnd more…Competitive salary and equity packagesThe opportunity to be part of a values-driven, hardworking, and diverse group of people building a media company that makes it easier to live smarterOur story, Skimm'dWe are a digital media company, dedicated to succinctly giving women the information they need to make confident decisions. We make it easier to live smarter.At our core, we are writers, editors, producers, designers, marketers, engineers, analysts, sellers, creatives, and strategists all working together to achieve this goal.Every day we're breaking down the news, trends, policies, and politics that impact women so that they can navigate their daily lives and futures – from managing their paychecks to casting their ballots – with confidence. We provide our dedicated audience of millions with reliable, non-partisan, information, informing and empowering them while fitting into their daily routines.Since disrupting the media landscape and defining a new category a decade ago, we have become a trusted source for our audience of millions by seamlessly integrating into their existing routines, fundamentally changing the way they consume news and make decisions. Today theSkimm ecosystem includes the Daily Skimm, the Daily Skimm: Weekend, Skimm Money and Skimm Your Life newsletters, \"9 to 5ish with theSkimm\" podcast, theSkimm mobile app, and Skimm Studios which creates innovative in-house video and audio content. Our first book, How to Skimm Your Life debuted at #1 on The New York Times Best Seller list. Through Skimm Impact, our purpose-driven platform, we are proud to support get-out-the-vote efforts with Skimm Your Ballot, which has spurred more than one million voting-related actions across the last three election cycles, and its #ShowUsYourLeave movement, creating transparency and change for Paid Family Leave in the U.S.Come join us!Learn More About Us And Our Other Opportunities Here.What about the office?This is a full-time role with flexibility for remote work.Our office is available to use three days a week - Tuesday, Wednesday, and Thursday. We have a hybrid environment and ask that employees within the New York Metro area come together in person a minimum of three days per month. All other days are up to the discretion of the employees during the three days a week that the office will be open.We are continuing to closely monitor the state of COVID-19 in New York and will adjust this plan accordingly.Any correspondence from our team will come from a @theskimm.com email account!Please click here for theSkimm's Privacy Policy and Terms & Conditions.Important Notice to Job Applicants residing in the State of CaliforniaNatural persons who reside in the State of California should review the Notice to California Residents (Job Applicants). You may have additional rights under California law."
    },
    {
        "Job ID": "3504020464",
        "Job Title": "Data Engineer",
        "Company Name": "Blue Onion",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-02-03",
        "Seniority level": "Entry level",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Software Development",
        "job_description": "How We’re Different We’re a lean team so all of your work will have a direct and measurable impact on the business You’ll have the opportunity interact with some of our amazing beta customers who are constantly providing feedback and helping us make the product better You’ll have the opportunity to craft elegant, efficient, and (sometimes!) scrappy solutions to hard technical problems using the latest and greatest tools and technologiesTechnology Our application runs on a tech stack that is a mixture of Python and Ruby on Rails + React For our backend data processing, we use Apache Airflow.  For our web application, we use Ruby on Rails, with a Typescript/React single-page-app frontend, powered by a GraphQL APIWhat Your Day Would Look Like Build scalable and fault-tolerant data pipelines in Google Cloud Platform using Apache Airflow Inspect, analyze, and transform data using SQL based tools like BigQuery and dbt Design, implement, and test features on our web application Build integrations with external servicesWhat We Look For You’re the best at what you do, take ownership for your work and are constantly looking to learn 3+ years of experience in Python and SQL You have experience with Apache Airflow and familiarity with AWS or GCP"
    },
    {
        "Job ID": "3492642448",
        "Job Title": "Python Data Engineer",
        "Company Name": "TechTA LLC",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-01-27",
        "Seniority level": "Mid-Senior level",
        "Employment type": "Contract",
        "Job function": "Information Technology",
        "Industries": "Internet Publishing",
        "job_description": "We are TechTA, a New York-based talent acquisition firm. Our team delivers a quality talent connection to. VisitOur client is searching for a Python Developer proficient in data engineering. This role is US-based, contract-based with a 6-12 month duration, 100% remote with highly competitive compensation and is open to H1B and C2C.Experience RequirementsDevelopment experience with Tableau or similar platform, using multiple data sourcesExperience writing, testing and debugging SQL queriesWorking with Python in a development environmentNot quite a match with your skill set? We'd still like to talk!TechTA LLC is committed to ensuring the security and protection of the personal information that we process, and to provide a compliant and consistent approach to data protection. If you have any questions related to our GDPR compliance, please contact our Data Protection Officer or make a Data Subject Access Request.We value your privacy! TechTA LLC will not distribute, sell, share, or transfer your data to any commercial entity without your express written permission.Powered by JazzHR3homGmGnDh"
    },
    {
        "Job ID": "3512094279",
        "Job Title": "Data Engineer",
        "Company Name": "TechTA LLC",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-03-04",
        "Seniority level": "Mid-Senior level",
        "Employment type": "Contract",
        "Job function": "Information Technology",
        "Industries": "Internet Publishing",
        "job_description": "We are TechTA, a New York-based tech-forward talent acquisition firm that bridges great talent to great opportunities. All of our clients are committed to a five-star candidate experience.Visit us atOur client is searching for a Data Engineer with at least 5 years of experience. This is a contract role, 100% remote at this time.Experience Requirements5+ years of experience with SQL, data modeling, design, and implementation.Advanced SQL programming capabilities with Data Analytics capabilitiesStrong data warehouse and ETL/ELT backgroundExperience creating data integration solutions, recognizing data patterns (e.g., data profiling and data wrangling), and developing datasets to support reporting deliverables.Good Experience with any reporting tool (such as Tableau or Power BI)Hands-on SQL skills to analyze complex datasets and deliver insights that drive business resultsNice To Have, But Not RequiredKnowledge of SQL Server Data Warehousing (SSMS/SSIS/SSRS)Working experience with Azure Cloud, GCP and/or AWSAbility to build data pipelines with modular coding techniquesNot quite a match with your skill set? We'd still like to talk!TechTA LLC is committed to ensuring the security and protection of the personal information that we process, and to provide a compliant and consistent approach to data protection. If you have any questions related to our GDPR compliance, please contact our Data Protection Officer or make a Data Subject Access Request.We value your privacy! TechTA LLC will not distribute, sell, share, or transfer your data to any commercial entity without your express written permission.Powered by JazzHRWjnRbOZafL"
    },
    {
        "Job ID": "3467207033",
        "Job Title": "Data Engineer, Analytics",
        "Company Name": "Meta",
        "Location": "New York, NY",
        "Salary": "$134,000.00-$194,000.00",
        "Publish Date": "2023-01-09",
        "Seniority level": "Not Applicable",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Technology, Information and Internet",
        "job_description": "Every month, billions of people leverage Meta products to connect with friends and loved ones from across the world. On the Data Engineering Team, our mission is to support these products both internally and externally by delivering the best data foundation that drives impact through informed decision making. As a highly collaborative organization, our data engineers work cross-functionally with software engineering, data science, and product management to optimize growth, strategy, and experience for our 3 billion plus users, as well as our internal employee community. In this role, you will see a direct correlation between your work, company growth, and user satisfaction. Beyond this, you will work with some of the brightest minds in the industry, and you'll have a unique opportunity to solve some of the most interesting data challenges with efficiency and integrity, at a scale few companies can match. As we continue to expand and create, we have a lot of exciting work ahead of us!Data Engineer, Analytics Responsibilities:Conceptualize and own the data architecture for multiple large-scale projects, while evaluating design and operational cost-benefit tradeoffs within systemsCreate and contribute to frameworks that improve the efficacy of logging data, while working with data infrastructure to triage issues and resolveCollaborate with engineers, product managers, and data scientists to understand data needs, representing key data insights in a meaningful wayDefine and manage SLA for all data sets in allocated areas of ownershipDetermine and implement the security model based on privacy requirements, confirm safeguards are followed, address data quality issues, and evolve governance processes within allocated areas of ownershipDesign, build, and launch collections of sophisticated data models and visualizations that support multiple use cases across different products or domainsSolve our most challenging data integration problems, utilizing optimal ETL patterns, frameworks, query techniques, sourcing from structured and unstructured data sourcesAssist in owning existing processes running in production, optimizing complex code through advanced algorithmic conceptsOptimize pipelines, dashboards, frameworks, and systems to facilitate easier development of data artifactsInfluence product and cross-functional teams to identify data opportunities to drive impactMentor team members by giving/receiving actionable feedbackMinimum Qualifications:Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.4+ years of work experience in data engineering (a minimum of 2+ years with a Ph.D)Experience with SQL, ETL, data modeling, and at least one programming language (e.g., Python, C++, C#, Scala, etc.)Preferred Qualifications:Master's or Ph.D degree in a STEM fieldExperience with one or more of the following: data processing automation, data quality, data warehousing, data governance, business intelligence, data visualization, data privacyExperience working with terabyte to petabyte scale dataMeta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. We may use your information to maintain the safety and security of Meta, its employees, and others as required or permitted by law. You may view Meta's Pay Transparency Policy, Equal Employment Opportunity is the Law notice, and Notice to Applicants for Employment and Employees by clicking on their corresponding links. Additionally, Meta participates in the E-Verify program in certain locations, as required by law"
    },
    {
        "Job ID": "3526197638",
        "Job Title": "Data Engineer/Data Scientist/Machine Learning Engineer",
        "Company Name": "WalletConnect",
        "Location": "New York, United States",
        "Salary": null,
        "Publish Date": "2023-03-14",
        "Seniority level": "Not Applicable",
        "Employment type": "Full-time",
        "Job function": "Engineering",
        "Industries": "Technology, Information and Internet",
        "job_description": "WalletConnect is the open-source web3 standard to connect blockchain wallets to dapps. Any wallet, any dapp, any chain. Starting in 2018, our mission is to make web3 accessible to everyone. Every month, millions of people use WalletConnect in thousands of integrations. We raised ~$25M from venture investors including 1kx and Coinbase as well as from customers such as Shopify and Circle. We are growing fast both in terms of features and users.To learn more about our plans to create a multi-API messaging network for web3, take a look at our presentation at EthCC.The Role:We are looking for someone who can help mature our existing data applications and innovate new use cases. Our existing setup is data lake/warehouse with data science/bi applications as customers. We use DBT/Athena/Glue (Spark)/RDS/Python/Terraform.Data is business critical for us and this quarter we need to improve our monitoring and build new use cases over the existing plumbing.We’re looking for someone who can act as a leader in our data team and help set and fulfill the vision.Responsibilities:Design and implement end-to-end data pipelines, and work closely with stakeholders to build instrumentation and define data modelsTake ownership of monitoring to ensure high availability of our data toolingBuild actionable production-quality internal dashboards, with well defined KPI’sWork with the Cloud team to create customer-focused dashboards to help customers understand their WalletConnect usage.Partner closely with product, engineering and other business stakeholders to influence product and business decisions with dataInfluence leadership to drive more data-informed decisionsRequirementsMust have:3+ years of experience as a Data engineer/scientist. Extensive experience with Python/Spark/databasesDeep understanding of advanced SQL techniques, dimensional modeling and scaling ETL pipelinesExperience with applied statistics and quantitative modelingDemonstrated knowledge in monitoring data systemsNice to have:Terraform knowledgeDomain experience in crypto and SaaS would be a plusKnowledge of Rust and TypeScript (help on data ingestion pipeline)Demonstrated ability to translate analytical insights into clear recommendations and effectively communicate them to technical and non-technical stakeholdersStrong background in statistical modeling such as regression, survival and cohort analysis, time series forecasting, etc.Experience in the AWS Glue/Athena toolsuite, Spark, PrestoBenefitsFully remote position with flexible timezone (CET/EST preferred)Competitive salaryCompany equityRemote work allowanceToken offering"
    },
    {
        "Job ID": "3461085680",
        "Job Title": "Data Engineer",
        "Company Name": "WireScreen",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-02-01",
        "Seniority level": "Not Applicable",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Information Services",
        "job_description": "About UsWirescreen.ai is a venture-backed startup with a mission to help global businesses make smarter investment decisions, track their supply chains, monitor cross-border transactions and respond to evolving global risks. Our leadership team includes a Pulitzer Prize winner and senior engineers who have worked at Google, Twitter and Oracle. We aim to build the world’s leading global supply chain platform, and our AI-driven data platform is already the industry leader in tracking Chinese businesses and entrepreneurs.We are looking for a Junior engineer with outstanding programming skills and a good understanding of web technologies for a data engineer role. In this position, you will play an important part in acquiring, extracting, and processing data that powers Wirescreen’s platform and servicesWhat You'll Do At WireScreen:As a startup we all wear multiple hats, so you’ll need to be comfortable with both a hands-on mandate and a broader portfolio of responsibilities. While there may be some ambiguity as we collectively learn and improve, this role offers a unique opportunity to develop a breadth of skills alongside a highly motivated, capable team.Understand the structure of data in websites and APIs. Find innovative ways to get data across multiple sourcesWork on large-scale crawling and scraping applications, API data extractions, data integrity, and monitoring systemsDesign, implement, and maintain various components in our data pipelineWho You Are/You Have:Solid programming skills in Python. Familiarity with SQLGood understanding of engineering and computer science fundamentalsStrong communication skills. Team player with a can-do attitude Passionate about data engineering and data scrapingFast Learner/CuriousExcited about working in a fast-paced startup environmentIdeally, You'll Also Have:Experience working on a public cloud platform, preferably AWSExperience using Apache Spark and scientific Python. A desire to be a team player, can collaborate and communicate well with different audiences while bringing a result-driven, focused, high energy, confident, curious, quirky, and most of all fun sense of self, then we’d love to have you join us!Why WireScreen? Why Now?We are seeking candidates who aspire to excellence; colleagues who are curious, passionate and determined to build something innovative. We are eager to learn new things and collaborate on projects that aspire to change the way people understand the architecture of global business, and its role in shaping our society and the environment.The base pay range for this position and to exclude possible bonus, equity, commissions, enhancements, etc is $85,000-$125,900+ per/year may vary depending on job-related knowledge, skills and experience"
    },
    {
        "Job ID": "3490762974",
        "Job Title": "Senior Data Engineer - Data Sourcing",
        "Company Name": "Revelio Labs",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-01-25",
        "Seniority level": "Mid-Senior level",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Internet Publishing",
        "job_description": "Who we are:Revelio Labs provides workforce intelligence. We absorb and standardize hundreds of millions of public employment records to create the world’s first universal HR database, allowing us to see current workforce composition and trends of any company. Our customers include investors, corporate strategists, HR teams, and governments.What we’re looking for:Revelio Labs is looking for a data acquisition specialist who has proven expertise in data sourcing, web scraping, and data engineering. You will oversee and own the full lineage of data sources and feeds, from scraping and parsing to ingestion and model integration.We are looking for someone who can design and implement web crawlers to source public data that will generate powerful insights on the labor market, integrate proprietary models to standardize and augment data sources, and increase the resiliency of existing data streams, as well as build a generalized framework to automate data acquisition, ingestion, and augmentation.Experience and Skills: Required: Strong knowledge of Python and TypeScriptExperience building large-scale, high-volume web scrapersExperience with bot prevention services and reverse engineering web applicationsDeep understanding of web technologies, frameworks, and network protocols (HTML, JavaScript, HTTP, etc) Preferred: Experience building and maintaining ETL/ELT pipelinesExperience with cloud monitoring and administration toolsFamiliarity with big data processing tools (e.g. Spark)Knowledge of data warehouse maintenance best practices, including data wrangling, model integration, anomaly detection, and documentationKnowledge of common CI/CD practices, including continuous build/test/deploy automationLocation:Our offices are based in New York City, but the position can be done remotely.Salary:The pay range for this position in New York City is $120,000 - $200,000 per year. The salary range for performing this role outside of New York City may differ. Base pay offered may vary depending on job-related knowledge, skills, and experience. Additionally, you may be eligible to participate in our company’s equity program, plus benefits, including medical, dental, vision, retirement, and other. The range above is for the expectations as laid out in the job description, however we are often open to a wide variety of profiles, and recognize that the person we hire may be more senior or have different experience than this job description as posted. If that ends up being the case, the updated salary range will be communicated to you as a candidate.Why you should work with us:We are putting public data to incredible use, providing unparalleled insight into the workforces of companies and industries. You’ll work with a strong and innovative team of engineers who have created the most comprehensive set of labor market data available, and who will continue to discover valuable information in all corners of the public web.Powered by JazzHRJc1jYKKpVh"
    },
    {
        "Job ID": "3516891520",
        "Job Title": "Data Engineer, Database Engineering",
        "Company Name": "Experfy",
        "Location": "New York, United States",
        "Salary": null,
        "Publish Date": "2023-02-11",
        "Seniority level": "Not Applicable",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Technology, Information and Internet",
        "job_description": "As a Data Engineer for our Data Platform Engineering team you will join skilled Scala/ Spark engineers and core database developers responsible for developing hosted cloud analytics infrastructure (Apache Spark-based), distributed SQL processingframeworks, proprietary data science platforms, and core database optimization. This team is responsible for building the automated, intelligent, and highly performant query planner and execution engines, RPC calls between datawarehouse clusters, shared secondary cold storage, etc. This includes building new SQL features and customer-facing functionality, developing novel query optimization techniques for industry-leading performance, and building a databasesystem that's highly parallel, efficient and fault-tolerant. This is a vital role reporting to exec leadership and senior engineering leadershipRequirementsResponsibilities:Writing Scala code with tools like Apache Spark + Apache Arrow + Apache Kafka to build a hosted, multi-cluster data warehouse for Web3Developing database optimizers, query planners, query and data routing mechanisms, cluster-to-cluster communication, and workload management techniques.Scaling up from proof of concept to “cluster scale” (and eventually hundreds of clusters with hundreds of terabytes each), in terms of both infrastructure/architecture and problem structureCodifying best practices for future reuse in the form of accessible, reusable patterns, templates, and code bases to facilitate meta data capturing and managementManaging a team of software engineers writing new code to build a bigger, better, faster, more optimized HTAP database (using Apache Spark, Apache Arrow, Kafka, and a wealth of other open source data tools)Interacting with exec team and senior engineering leadership to define, prioritize, and ensure smooth deployments with other operational componentsHighly engaged with industry trends within analytics domain from a data acquisition processing, engineering, management perspectiveUnderstand data and analytics use cases across Web3 / blockchainsSkills & QualificationsBachelor’s degree in computer science or related technical field. Masters or PhD a plus.6+ years experience engineering software and data platforms / enterprise-scale data warehouses, preferably with knowledge of open source Apache stack (especially Apache Spark, Apache Arrow, Kafka, and others)3+ years experience with Scala and Apache Spark (or Kafka)A track record of recruiting and leading technical teams in a demanding talent marketRock solid engineering fundamentals; query planning, optimizing and distributed data warehouse systems experience is preferred but not requiredNice to have: Knowledge of blockchain indexing, web3 compute paradigms, Proofs and consensus mechanisms... is a strong plus but not requiredExperience with rapid development cycles in a web-based environmentStrong scripting and test automation knowledgeNice to have: Passionate about Web3, blockchain, decentralization, and a base understanding of how data/analytics plays into thisApply for this job"
    },
    {
        "Job ID": "3518418855",
        "Job Title": "Sr. Data Engineer",
        "Company Name": "Experfy",
        "Location": "New York, United States",
        "Salary": null,
        "Publish Date": "2023-02-12",
        "Seniority level": "Not Applicable",
        "Employment type": "Contract",
        "Job function": "Information Technology",
        "Industries": "Technology, Information and Internet",
        "job_description": "A Sr. Data Engineer is proficient in the development of all aspects of data processing including data warehouse architecture/modeling and ETL processing. The position focuses research on development and delivery of analytical solutions using various tools including Confluent Kafka, Kinesis, Glue, Lambda, Snowflake and SQL Server. A Sr. Data Engineer must be able to work autonomously with little guidance or instruction to deliver business value.ResponsibilitiesPosition Responsibilities Partner with business stakeholders to gather requirements and translate them into technical specifications and process documentation for IT counterparts (on-prem and offshore) Highly proficient in the architecture and development of an event driven data warehouse; streaming, batch, data modeling, and storage Advanced database knowledge; creating/optimizing SQL queries, stored procedures, functions, partitioning data, indexing, and reading execution plans Skilled experience in writing and troubleshooting Python/PySpark scripts to generate extracts, cleanse, conform and deliver data for consumption Expert level of understanding and implementing ETL architecture; data profiling, process flow, metric logging and error handling Support continuous improvement by investigating and presenting alternatives to processes and technologies to an architectural review board Develop and ensure adherence to published system architectural decisions and development standards Multi-task across several ongoing projects and daily duties of varying priorities as required Interact with global technical teams to communicate business requirements and collaboratively build data solutionsRequirementsRequirements 8+ years of development experience Expert level in data warehouse design/architecture, dimensional data modeling and ETL process development Advanced level development in SQL/NoSQL scripting and complex stored procedures (Snowflake, SQL Server, DynomoDB, NEO4J a plus) Extremely proficient in Python, PySpark, and Java AWS Expertise – Kinesis, Glue (Spark), EMR, S3, Lambda, and Athena Streaming Services – Confluent Kafka and Kinesis (or equivalent) Hands on experience in designing and developing applications using Java Spring Framework (Spring Boot, Spring Cloud, Spring Data etc)Apply for this job"
    },
    {
        "Job ID": "3490766554",
        "Job Title": "Senior Data Engineer - Generalist",
        "Company Name": "Revelio Labs",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-01-25",
        "Seniority level": "Mid-Senior level",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Internet Publishing",
        "job_description": "Who we are:Revelio Labs provides workforce intelligence. We absorb and standardize hundreds of millions of public employment records to create the world’s first universal HR database, allowing us to see current workforce composition and trends of any company. Our customers include investors, corporate strategists, HR teams, and governments.What we’re looking for:Revelio Labs is looking for a senior data engineer who is creative and flexible. The ideal candidate will be a voracious learner who can make important contributions to a variety of engineering and modeling projects and who has the ability to glue together various datasets and services. We’re looking for someone who can recognize repeated patterns and develop generalized solutions to automate them away.You will develop deep expertise in many of our core systems and models and relentlessly automate processes to improve the technical and operational scalability of our company. You will also work directly with customers to build data products that they love.Experience and Skills:PythonSQLCloud computingLocation:Our offices are based in New York City, but the position can be done remotely.Salary:The pay range for this position in New York City is $100,000 - $200,000 per year. The salary range for performing this role outside of New York City may differ. Base pay offered may vary depending on job-related knowledge, skills, and experience. Additionally, you may be eligible to participate in our company’s equity program, plus benefits, including medical, dental, vision, retirement, and other. The range above is for the expectations as laid out in the job description, however we are often open to a wide variety of profiles, and recognize that the person we hire may be more senior or have different experience than this job description as posted. If that ends up being the case, the updated salary range will be communicated to you as a candidate.Why you should work with us:We are working on some of the most challenging and cutting-edge data science problems. You will work with a team of PhD data scientists with advanced domain expertise. Our startup is small and growing quickly, with enormous potential for growth.Powered by JazzHRCzxbKyyBAZ"
    },
    {
        "Job ID": "3509793440",
        "Job Title": "Data Engineer",
        "Company Name": "Networx",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-02-07",
        "Seniority level": "Entry level",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Advertising Services",
        "job_description": "DescriptionWho are we, and what are we looking for?You've got the opportunity to join our awesome team!At Networx, we empower great people to do great work! Our core values are Chop Wood Carry Water, Do the Right Thing, Celebrate Success, and Evolve. These values guide our behaviors, and bold targets encourage us to bring our best selves to work daily. Our culture of fun, collaboration, and growth will help us all to share in the rewards of meeting our company mission; “Win Contractors More Jobs”.We are looking for a talented Data Engineer to join our team to build our data infrastructure and help create a data-first company culture. You will work with our Data team, to develop consistent and machine-readable formats. You will help Networx stakeholders to answer business questions utilizing data. This position is right for you if you want to or have the following: OWN our data infrastructure, KNOW how to turn raw data into consumable data, HAVE SQL experience, COMMUNICATES effectively, are PASSIONATE about data, and THRIVE in an environment where your ideas are valued. If this is you, we invite you to apply to join the Networx team!ResponsibilitiesWhat You’ll DoBuild the Data Warehouse to support the organizational growth Create data integrations from external sources into the warehouse using StitchBuild data modeling and transformations using DBTBuild the data pipeline ensuring data accuracy and validation processes are included Use an understanding of the business to provide data that supports stakeholder needsOwn data pipelines and use them to help stakeholders make informed decisionsRequirementsMust HaveStrong experience with SQL, of at least 2 yearsAn independent, self-learner who is passionate about dataHigh-level verbal and written communication skillsAbility to take business understanding into consideration when building the infrastructureAble to own data projects and data pipelinesData modeling and creation of data marts experienceThis position is open to candidates who live in the Atlanta, GA or New York, NY Metropolitan areasNice to HaveA bachelor's degree in Mathematics, Data Science, or a related fieldExperience with Snowflake / Google Big Query, DBT, Stitch, and HightouchExperience working with teams that are geographically dispersed including international team membersBenefitsYou’ll EarnHealth Care Plans (Medical, Dental & Vision)Health Care Spending (HSA & FSA)Retirement Plan (401k)Life Insurance (Basic, Voluntary & AD&D)Paid Time Off (Vacation, Bereavement & 9 Paid Holidays)Short-Term & Long-Term DisabilityTraining & DevelopmentWork From Home FlexibilityWellness ResourcesCompetitive pay and bonusThis position offers work-from-home flexibility for candidates who live in the Atlanta or New York City Metropolitan areas.Networx proudly supports diversity in the workplace and is an Equal Opportunity Employer.The expected base salary range for this position is $110,000 - $125,000 per year. This position is eligible for an annual cash bonus. The salary offered may vary depending on factors such as job-related knowledge, skills, and experience. Salary ranges are provided for New York City-based roles as required by New York City Human Rights Law.DISCLAIMER: The above information in this description has been designed to indicate the general nature and level of work performed by employees in this role. It is not designed to contain or be interpreted as an exhaustive list of all responsibilities, duties, and qualifications required of employees assigned to this job."
    },
    {
        "Job ID": "3515931919",
        "Job Title": "Data Engineer",
        "Company Name": "Attune",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-03-09",
        "Seniority level": "Entry level",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Technology, Information and Internet",
        "job_description": "Attune is making it easier, faster, and more reliable for small businesses to access insurance (think, pizza place down the street or main street store). They all need insurance to protect their businesses, but when it comes time to get a policy, they're bogged down by hundreds of questions, lots of paperwork, and a seemingly never-ending timeline stretching for weeks or months.We are changing all that. By using data and technology expertise to understand risk, automating legacy processes, and creating a better user experience for brokers, we're able to provide policies that are more applicable and more transparent in just minutes.Simply put, we're pushing insurance into the future, focusing on accuracy, speed, and ease.Our mission and our team are growing. In staying true to our values, we've earned our spot on many workplace award lists. Attune is dedicated to creating a diverse team of curious, focused, and motivated people who are excited about changing the future of an entire industry.Job DescriptionAs a Data Engineer joining our growing Data team, you will help maintain our existing data pipelines and internal web applications. You will also work with team members across the organization to develop and test new pipelines as we launch new products and integrate with third-party data sources. We work with various tools including Python/Pandas, Postgresql, Bash, AWS EC2, and S3. We are always open to using whatever tool is best for the job.Responsibilities:Maintain and improve batch ETL jobs - including SQL query optimization, bug fixes and code improvementsWork with our data engineers, BI, and other teams across the business to develop/refine ETL processesUnderstand and answer questions on the data our team maintainsRequirements:3+ years experience in analytics, data science, or data engineering roleStrong Python and Postgresql skillsSolid understanding of relational database design and basic query optimization techniquesExperience working with git, and Gitlab or GithubNice to have:Experience with Linux CLI, shell programmingUnderstanding of CI/CDExperience with AWS EC2 and S3"
    },
    {
        "Job ID": "3498800679",
        "Job Title": "Data Engineer Intern - FT For-Credit",
        "Company Name": "Open Road Media",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-01-30",
        "Seniority level": "Internship",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Photography",
        "job_description": "About Open Road Integrated MediaOpen Road Integrated Media is a prestige content brand delivering digital experiences that entertain and inform readers around the world. Open Road was founded in 2009 with the belief that great marketing and great content are the engines of growth for underserved authors and books. This philosophy is at the core of everything that we do. Open Road revolutionizes how publishers service authors, agents, and readers.SummaryThe Data Engineering and Analytics team is seeking two full-time, for-credit Data Engineer Interns. This role will work closely with the team on various types of tasks and projects. The members of Data Engineering and Analytics team uses rigorous analytics to generate insights that inform product, marketing, and business decisions across the company. In the meantime, we build systems, infrastructure, data products for collecting, storing, and visualizing data to foster the data democracy in the company. We work in Python, SQL and we work with technologies like Airflow, Django, Tableau, Spark.Essential FunctionsCreate ETL pipelines to fetch data from data sources and ingest into databasesWrite/Optimize SQL queries for different views of data productsCreate tableau reports with multiple data points married togetherDeploy tracking tags for the collection of clickstream data on the sitesBuild scripts to automate the current manual workflow of other departmentsRequirementsAvailable approximately 40 hours per week for 8 weeksExperience in writing complex SQL queries to extract data from relational databases (e.g. MySQL, Redshift)Comfortable with extensive Python codingWilling to work with a codebase that is not originally written by youGood communication skills; understand that being an effective Data Engineer Intern is about communicating with people as much as it is about writing codeWilling to learn any language/tools that are necessary to get the job done"
    },
    {
        "Job ID": "3491146686",
        "Job Title": "Data Engineer Intern - FT For-Credit",
        "Company Name": "Open Road Integrated Media Inc.",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-01-26",
        "Seniority level": "Internship",
        "Employment type": "Internship",
        "Job function": "Information Technology",
        "Industries": "Internet Publishing",
        "job_description": "About Open Road Integrated MediaOpen Road Integrated Media is a prestige content brand delivering digital experiences that entertain and inform readers around the world. Open Road was founded in 2009 with the belief that great marketing and great content are the engines of growth for underserved authors and books. This philosophy is at the core of everything that we do. Open Road revolutionizes how publishers service authors, agents, and readers.SummaryThe Data Engineering and Analytics team is seeking two full-time, for-credit Data Engineer Interns. This role will work closely with the team on various types of tasks and projects. The members of Data Engineering and Analytics team uses rigorous analytics to generate insights that inform product, marketing, and business decisions across the company. In the meantime, we build systems, infrastructure, data products for collecting, storing, and visualizing data to foster the data democracy in the company. We work in Python, SQL and we work with technologies like Airflow, Django, Tableau, Spark.Essential FunctionsCreate ETL pipelines to fetch data from data sources and ingest into databasesWrite/Optimize SQL queries for different views of data productsCreate tableau reports with multiple data points married togetherDeploy tracking tags for the collection of clickstream data on the sitesBuild scripts to automate the current manual workflow of other departmentsRequirementsAvailable approximately 40 hours per week for 8 weeksExperience in writing complex SQL queries to extract data from relational databases (e.g. MySQL, Redshift)Comfortable with extensive Python codingWilling to work with a codebase that is not originally written by youGood communication skills; understand that being an effective Data Engineer Intern is about communicating with people as much as it is about writing codeWilling to learn any language/tools that are necessary to get the job donePowered by JazzHR1Zi2tEGJed"
    },
    {
        "Job ID": "3522666043",
        "Job Title": "Data & Analytics Engineer",
        "Company Name": "Rinsed",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-02-17",
        "Seniority level": "Entry level",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Software Development",
        "job_description": "As an early team member at Rinsed, you will have the opportunity to build a great data organization from the ground up and make important strategic decisions alongside the founders.We’ve invested heavily in our data infrastructure from day one, and believe that the insights derived from the over 2 million active car wash subscriptions we manage are key to creating our competitive advantage. Lifetime value, churn, cost-to-acquire and optimal pricing are huge untapped opportunities in this industry as it moves to a subscription model.As a founding team member, you'll have the opportunity to create the DNA of the product, team, and cultureJoin a lean, organization where data is central to the decision making process. Since the Rinsed tool sits on top of many different point-of-sale systems, you’ll design the architecture, storage, and transformation capabilities of the data pipelines that power our productOwn end-to-end data processes and drive outcomes. Collaborate with the rest of the engineering team to ensure quality and scalability of these data processesBuild external- and internal-facing dashboards that enable our customers to drive value using the millions of data points we gather on their operationsBuild the tools and models to measure and define internal product goalsSuggested backgroundExperience in a data analytics, data science, or data engineering roleAn “end-to-end” data analyst who believes in owning the whole stack from data cleaning to dashboard to stakeholder communicationProficient in writing performance SQL to generate business insights and drive better organizational decision makingYou have an entrepreneurial spirit and are adaptable to a fast-growing environment with a high tolerance for ambiguityA solid understanding of data warehouses and business intelligence toolsClear and direct communication skills about complex technical topicsA track record of working autonomously, with strong organizational and time management skillsA desire to continually keep up with advancements in data (engineering, analytics, science) team practicesYou want a high degree of autonomy and ownership, independently making good decisions for our customers and the businessTechnologies we use❄️Snowflake ❄️, Postgres, AWS, DBT, Metabase, Python"
    },
    {
        "Job ID": "3522453142",
        "Job Title": "Data Engineer (Hybrid)",
        "Company Name": "Care.com",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-03-14",
        "Seniority level": "Entry level",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Technology, Information and Internet",
        "job_description": "About Care.comCare.com is a consumer tech company with heart. We're on a mission to solve a human challenge we all face: finding great care for the ones we love. We're moms and dads and pet parents. We have parents and grandparents, so we understand that everyone, at some point in their lives, could use a helping hand. Our culture and our products reflect that.Here, entrepreneurs, self-starters, team players, and big thinkers unite behind a common cause. Here, we're applying data analytics, AI, and the latest technologies to solve universal problems and connect people in new ways. If you like having autonomy, if you thrive on collaboration and building new things, and if you're all about using your talent for good, Care.com is the place for you.Office Locations: (This is a hybrid position)NY, NY 10011Austin, TX 78746Shelton, CT 06484 What Your Days Will be Like:The Data Engineer will be focusing on building out data feeds and tooling from our application platform and enable rapid ingestion into our centralized Data Lake/Data Warehouse. The Data Engineer will work across business areas and application teams at Care.com to rationalize data and design, build and maintain reusable data feeds which and ultimately empower analytics consumption at Care.com.The ideal candidate will have professional experience building data pipelines in a technical environment. S/he will have an understanding of application development, data warehousing, demonstrate strong business judgment, and be able to prioritize in a fast-paced environment.What You'll Be Working On: Collaborate and partner with application teams to understand data collection/generation and design and partner to build and implement data feeds from our product tech stackDesign, develop, and build code for rapid feeds and ingestion into the Data WarehouseIdentify data sources used for building out data architecture diagrams/modelsEstablish engineering practices and setup frameworks for \"Data as a Service\"Collaborate with relevant delivery teams, including infrastructure, operations, site reliability engineering, product development, and others to perform evaluations, POCs, and ultimately implement and operationalize new technology. Solve code level problems quickly and efficiently Participate in demos and code reviews Promote software best approach, standards, and processes Shape development processes to promote a high-quality output while continuing to iterate quickly Incorporate best practices for security, performance, and data privacy into data pipelinesWhat You'll Need to Succeed: BS or MS in Computer Science or relevant engineering experience5+ years work experience in Data Engineering/data pipelines3+ years SQL experience preferred1+ years Unix/batch scripting preferred1+ years Python experience is a plus1+ years Windows server admin experience is a plusExperience interfacing with business teams and turning requirements and vision into a technical realityOracle & Postgres experience preferredMicroservices Architecture experience is a plusAWS experience is a plusAbility to drive efforts from start to finish as a self-motivatorKnowledge in Data Warehousing is a MUSTProven ability to maintain performance level in a fast-paced agile environment Pragmatic and realistic with solutionsFor a list of our Perks + Benefits, click here!Care.com supports diverse families and communities and seeks employees who are just as diverse. As an equal opportunity employer, Care.com recognizes the power of a diverse and inclusive workforce and encourages applications from individuals with varied experiences, perspectives, and backgrounds. Care.com is committed to providing reasonable accommodations for qualified individuals with disabilities. If you need assistance or accommodation, please reach out to talent@care.com.Company Overview:Available in more than 20 countries, Care.com is the world's leading platform for finding and managing high-quality family care. Care.com is designed to meet the evolving needs of today's families and caregivers, offering everything from household tax and payroll services and customized corporate benefits packages covering the care needs of working families, to innovating new ways for caregivers to be paid and obtain professional benefits. Since 2007, families have relied on Care.com's industry-leading products—from child and elder care to pet care and home care. Care.com is an IAC company (NASDAQ: IAC).Salary Range: 110,000 to 145,000. The base salary range above represents the anticipated low and high end of the national salary range for this position. Actual salaries may vary and may be above or below the range based on various factors including but not limited to work location, experience, and performance. The range listed is just one component of Care.com's total compensation package for employees. Other rewards may include annual bonuses and short- and long-term incentives. In addition, Care.com provides a variety of benefits to employees, including health insurance coverage, life, and disability insurance, a generous 401K employer matching program, paid holidays, and paid time off (PTO)."
    },
    {
        "Job ID": "3523235615",
        "Job Title": "Data Engineer",
        "Company Name": "Centiva Capital",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-03-11",
        "Seniority level": "Entry level",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Financial Services",
        "job_description": "Design and implement software for data integration, validation, monitoring, and analytics. Build data pipelines to onboard datasets from external vendors. Work with portfolio managers and researchers to design and implement proprietary datasets. Transform raw data into meaningful information using data-oriented programming languages and visualization software. Analyze and extract information from datasets to support trading and risk management. Provide level two production support for data-related issues. Design and implement analytic systems to track and manage data availability, access control, and usage statistics. Design and implement client facing web services that visualize, interpret, and report data findings. Write Python and SQL code. Work with data vendor APIs, including BPIPE, DataQuery, and CitiVelocity; web scraping in Python; and Linux and cloud (Azure) environments. Build data products suitable for quantitative research purposes. Write C# code to interact with Window file systems.Requirements: Bachelor’s degree in Computer Science, Mathematics, or related a field of study, plus one (1) year of experience with writing Python and SQL code; working with data vendor APIs; web scraping in Python; working under Linux and cloud environments; and building data products."
    },
    {
        "Job ID": "3528569655",
        "Job Title": "Senior Data Engineer",
        "Company Name": "Glocomms",
        "Location": "New York, United States",
        "Salary": "$200,000.00-$300,000.00",
        "Publish Date": "2023-03-17",
        "Seniority level": "Mid-Senior level",
        "Employment type": "Full-time",
        "Job function": "Finance",
        "Industries": "Capital Markets, Financial Services, and Investment Management",
        "job_description": "On our research team—you’ll partner with our Investment Professionals and Compliance team to uncover insights about companies, industries, and the broader economy through deep fundamental research and applying data science and engineering techniques to alternative data sets. You’ll work alongside a talented team with diverse skills, backgrounds, and perspectives. Our industry researchers, product managers, and data scientists and engineers work together to build compliant research products that answer the questions our investment professionals care about most. ROLE SUMMARYSenior Data Engineers on the team design and build solutions that enable investment professionals to effortlessly extract insights from large, complex structured and unstructured data sets. As a senior member of our Data Engineering team, you will help set technical direction and work closely with investment professionals, researchers, and data scientists to design, build, and launch robust end-to-end data pipelines and tools that that help extract the most value out of our data assets. In this role, you will:Develop and support big data processing pipelines including but not limited to ingestion, transformation, and end-customer deliveryBuild out cloud-based infrastructure using distributed techniques for other data engineers / data scientists / researchersBe at the forefront of new technology developments with respect to the handling and processing of big data and conduct proof of concepts evaluations of new technologiesBuild and support visualization and exploration capabilities around our big data setsWHAT EXCITES YOUTechnical leadership through hands-on developmentHaving a broad impact on architecture and team processesTransforming large unstructured, data sets into valuable investment research inputsLearning and working with industry-leading cloud-computing technologiesSpeaking with experts both inside and outside the firm to understand data needs and offeringsFast-paced work environments that at times require switching gears to address the needs of the businessWorking as part of a cross-functional team made up of Investment, Research, and Compliance professionalsWHAT EXCITES USAbility to directly or indirectly lead development efforts involving multiple engineers and stakeholdersExcellent attention to detail, organization, and project management skillsSuperb business intuition and a solution orientated, methodological approach to problem solvingAbility to collaborate and build relationships across multiple business units within the firmPeople who “elevate the room” through their work ethic, curiosity, and solution-orientated attitudeAdherence to the highest ethical standards working closely with the firm’s Compliance teamWHAT’S REQUIRED 5+ years of experience in Data Engineering or related development work with distributed data technologyExperience with system design and leading multi-person development effortsStrong experience in Python developmentExperience with Spark and Cloud computing is a plusTrack record of delivering novel and innovative solutions to challengesKnowledge of/experience with graph databases is a plus"
    },
    {
        "Job ID": "3516687568",
        "Job Title": "Data Engineer",
        "Company Name": "Geopath",
        "Location": "New York, United States",
        "Salary": null,
        "Publish Date": "2023-03-10",
        "Seniority level": "Mid-Senior level",
        "Employment type": "Full-time",
        "Job function": "Engineering, Design, and Analyst",
        "Industries": "IT Services and IT Consulting, Market Research, and Financial Services",
        "job_description": "Applicants must be authorized to work for any employer in the United States. We are unable to sponsor, or take over sponsorship, of an employment visa at this time.About the roleReporting to the SVP, Data & Technology and Lead Data Engineer, the Data Engineer will play a critical role in supporting and advancing Geopath’s new audience measurement platform.Responsibilities:Build scalable functions, fault tolerant batch & real time data pipelines to validate/extract/transform/integrate large scale datasets inclusive of location and time series data, across multiple platformsReview current data processes to identify improvement areas: design and implement solutions to improve scalability, performance, cost efficiencies and data qualityExtend and optimize Geopath’s data platform, which spans across multiple cloud services, data warehouses, and applications in order to meet the industry’s evolving data needsResearch, evaluate, analyze and integrate new data sources and develop quick prototypes for new data productsWork closely with product owners, data architects, data scientists and application development teams to quickly define prototypes, and build new data productsDevelop a solid understanding of the nuances within Geopath’s foundational data sourcesSupport internal stakeholders including data, design, product and executive teams by assisting them with data-related technical issuesRequirements:Bachelor’s or master's degree in computer science, computer engineering, informatics, or equivalent fields3+ years of experience as a Data Engineer with demonstrated experience in data modeling, ETL, data warehouse/data lakes, and consolidating data from multiple data sources3+ years of experience with SQL, solid experience in writing stored procedures and UDFs, familiarity with Snowflake’s data warehouse a plus2+ years of experience in building and optimizing scalable and robust big data pipelines in Apache Airflow or other workflow engines and fluent in Python or Java programmingGood working knowledge in data partition and query optimizationExperience or desire to work in a start-up environment, good team player, and can work independently with minimal supervisionGreat analytical and problem-solving skills, eager to learn new technologies and willing to wear different hats in a small team settingGreat communication and organizational skillsAbout Geopath Inc.Established in 1933, Geopath, (previously the Traffic Audit Bureau for Media Measurement Inc.,) has been the gold standard in providing media auditing and audience measurement services for the Out of Home industry in the US for 90 years. Geopath has now expanded its historical mission and is looking to the future by modernizing its mission critical, industry-standard media audience rating platform while embracing the digital era. In addition to being the industry’s media auditing solution, Geopath also analyzes people’s movement data, develops deep consumer insights, innovations and advanced media research methodologies to uncover critical insights about how consumers engage with Out of Home advertising across a multi-channel ecosystem and in the physical world."
    },
    {
        "Job ID": "3515644963",
        "Job Title": "Data Engineer",
        "Company Name": "Stytch",
        "Location": "New York, NY",
        "Salary": null,
        "Publish Date": "2023-02-10",
        "Seniority level": "Entry level",
        "Employment type": "Full-time",
        "Job function": "Information Technology",
        "Industries": "Software Development",
        "job_description": "What We're Looking ForStytch is the platform for user authentication. We build infrastructure that sits in the critical path of our customer's applications. As a data engineer, you'll work on designing and building event-driven architecture systems to drive analytics insights and observability tooling for our customers.What Excites YouChampioning data-driven insights - you see data analytics and observability as a product critical to successSolving problems with pragmatic solutions — you know when to make trade-offs between completeness and utility and you know when to cut scope to ship something good enough quicklyBuilding products that make developers lives easier — as a data engineer for a developer infrastructure company, what you build will have an immediate impact on our customersShaping the culture and growing the team through recruiting, mentorship, and establishing best practicesLearning new skills and technologies in a fast paced environmentWhat Excites UsComfort working in a modern data stack using tools like Snowflake, Redshift, DBT, Fivetran, ElasticSearch, and KinesisAppreciation for schema design and architecture that balance flexibility and simplicityExperience designing and building highly reliable back-end and ETL systems3+ years as a data or backend engineerWhat Success Looks LikeTechnical — build new, highly reliable services that our customers can depend onOwnership — advocate for projects and solutions that you believe in and ship them to productionLeadership — level up your teammates by providing mentorship and guidanceOur Tech StackData moves through Snowflake, ElasticSearch, MySQL, and KinesisGo and Node for application servicesWe run on AWS with Kubernetes for containerizationgRPC and protobufs for internal service communicationExpected base salary $150,000-$300,000. The anticipated base salary range is not inclusive of full benefits including equity, health care insurance, time off, paid parental leave, etc. This base salary is accurate based on information at the time of posting. Actual compensation for hired candidates will be determined using a number of factors including experience, skills, and qualifications.We're looking to hire a GREAT team and that means hiring people who are highly empathetic, ambitious, and excited about building the future of user authentication. You should feel empowered to apply for this role even if your experience doesn't exactly match up to our job description (our job descriptions are directional and not perfect recipes for exactly what we need). We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. We look forward to hearing from you!Learn more about our team and culture here!"
    }
]
